bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21J17AU.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="BGBUFREADY4" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="RX" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="TX" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="CMP2" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN8" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y24" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y22" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="XIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="XOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="TX" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="RX" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="CMP3" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="OUT2" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y26" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN6" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y25" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y23" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y21" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y20" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="I"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>